#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.example: Reading...
aws_iam_role.lambda: Refreshing state... [id=c18-climate-monitor-lambda-iam]
aws_cloudwatch_log_group.historic_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-weather-lambda]
aws_iam_role.lambda_scheduler: Refreshing state... [id=c18-climate-monitor-scheduler-iam]
aws_cloudwatch_log_group.notifications: Refreshing state... [id=/aws/lambda/c18-climate-monitor-notifications-lambda]
aws_iam_role.orchestrator_lambda: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam]
aws_ecr_repository.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-ecr]
aws_ecr_repository.future_predictions: Refreshing state... [id=c18-climate-monitor-future-predictions-ecr]
aws_cloudwatch_log_group.location_assignment: Refreshing state... [id=/aws/lambda/c18-climate-monitor-location-assignment-lambda]
aws_ecr_repository.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-ecr]
data.aws_iam_policy_document.example: Read complete after 0s [id=1734155287]
aws_cloudwatch_log_group.streamlit_logs: Refreshing state... [id=/ecs/c18-climate-monitor-dashboard]
aws_cloudwatch_log_group.daily_summary: Refreshing state... [id=/aws/lambda/c18-climate-monitor-daily-summary-lambda]
aws_ecr_repository.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-ecr]
aws_ecr_repository.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-ecr]
aws_ecr_repository.flood_warning_check: Refreshing state... [id=c18-climate-monitor-flood-warning-check-ecr]
aws_cloudwatch_log_group.historic_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-air-quality-lambda]
data.aws_ecs_cluster.existing: Reading...
aws_ecr_repository.dashboard: Refreshing state... [id=c18-climate-monitor-dashboard-ecr]
aws_cloudwatch_log_group.new_location_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-new-location-orchestrator-lambda]
aws_ecr_repository.notifications: Refreshing state... [id=c18-climate-monitor-notifications-ecr]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=c18-climate-monitor-ecsTaskExecutionRole]
aws_ecr_repository.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-ecr]
aws_ecr_repository.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-ecr]
aws_cloudwatch_log_group.current_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-air-quality-lambda]
aws_cloudwatch_log_group.current_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-weather-lambda]
aws_cloudwatch_log_group.future_climate: Refreshing state... [id=/aws/lambda/c18-climate-monitor-future-predictions-lambda]
aws_ecr_repository.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-ecr]
aws_cloudwatch_log_group.current_reading_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-reading-orchestrator-lambda]
aws_cloudwatch_log_group.live_flood_warnings: Refreshing state... [id=/aws/lambda/c18-climate-monitor-live-flood-warnings-lambda]
aws_ecr_repository.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_security_group.streamlit_sg: Refreshing state... [id=sg-053789c7fe7a7e7d0]
aws_security_group.allow_5432: Refreshing state... [id=sg-00146638977b9f8dc]
aws_iam_role_policy_attachment.lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy_attachment.orchestrator_lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy.invoke_lambdas: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam:invoke-other-lambdas]
aws_iam_role_policy.pipeline_scheduler: Refreshing state... [id=c18-climate-monitor-scheduler-iam:c18-climate-monitor-scheduler-policy]
aws_iam_role_policy_attachment.ecs_execution_policy: Refreshing state... [id=c18-climate-monitor-ecsTaskExecutionRole/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
data.aws_ecs_cluster.existing: Read complete after 0s [id=arn:aws:ecs:eu-west-2:129033205317:cluster/c18-ecs-cluster]
aws_lambda_function.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-lambda]
aws_ecr_repository_policy.example: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_vpc_security_group_ingress_rule.allow_ingress_5432: Refreshing state... [id=sgr-0c0647e7620fc928e]
aws_db_instance.climate: Refreshing state... [id=db-FRWD4BKFF4THTAGHZDARGIT56U]
aws_lambda_function.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-lambda]
aws_lambda_function.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-lambda]
aws_lambda_function.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-lambda]
aws_lambda_function.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-lambda]
aws_lambda_function.future_climate: Refreshing state... [id=c18-climate-monitor-future-predictions-lambda]
aws_lambda_function.live_flood_warnings: Refreshing state... [id=c18-climate-monitor-live-flood-warnings-lambda]
aws_lambda_function.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-lambda]
aws_ecs_task_definition.streamlit_dashboard: Refreshing state... [id=streamlit-dashboard-task]
aws_lambda_function.notifications: Refreshing state... [id=c18-climate-monitor-notifications-lambda]
aws_lambda_function.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-lambda]
aws_lambda_function.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-lambda]
aws_ecs_service.streamlit_service: Refreshing state... [id=arn:aws:ecs:eu-west-2:129033205317:service/c18-ecs-cluster/c18-climate-monitor-dashboard-service]
aws_scheduler_schedule.live_flood_warnings_scheduler: Refreshing state... [id=default/c18-climate-monitor-live-flood-warnings-scheduler]
aws_scheduler_schedule.current_reading_orchestrator_scheduler: Refreshing state... [id=default/c18-climate-monitor-current_reading_orchestrator-scheduler]
aws_scheduler_schedule.daily_summary_scheduler: Refreshing state... [id=default/c18-climate-monitor-daily-summary-scheduler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_scheduler_schedule.notifications_scheduler will be created
  + resource "aws_scheduler_schedule" "notifications_scheduler" {
      + arn                          = (known after apply)
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "c18-climate-monitor-notifications-scheduler"
      + name_prefix                  = (known after apply)
      + region                       = "eu-west-2"
      + schedule_expression          = "cron(*/15 * * * ? *)"
      + schedule_expression_timezone = "Europe/London"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:lambda:eu-west-2:129033205317:function:c18-climate-monitor-notifications-lambda"
          + role_arn = "arn:aws:iam::129033205317:role/c18-climate-monitor-scheduler-iam"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @mattsnowdon1, Action: `pull_request`*